---
kind: type
id: T:Autodesk.Revit.DB.ConnectionResolution
source: html/0476e90d-8282-051a-17fe-b9559cd65490.htm
---
# Autodesk.Revit.DB.ConnectionResolution

An enumerated type listing all the possible resolutions for connectivity validation.

## Syntax (C#)
```csharp
public enum ConnectionResolution
```